src/cf/InformationRegisters/ПрименениеПереводовВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрименениеПереводовВПути</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПрименениеПереводовВПути/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Используются переводы в пути.
//
// Параметры:
//  ДатаПроверки - Дата - .
//  Организация	 - СправочникСсылка.Организации - .
// 
// Возвращаемое значение:
//  Булево - используются переводы в пути.
//
Функция ИспользуютсяПереводыВПути(ДатаПроверки = Неопределено, Организация = Неопределено) Экспорт
	
	Если ДатаПроверки = Неопределено Тогда
		ДатаПроверки = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза", ДатаПроверки);
	
	Если Организация = Неопределено Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаОрганизацийСрезПоследних.Организация
		|ИЗ
		|	РегистрСведений.ПрименениеПереводовВПути.СрезПоследних(&ДатаСреза, ) КАК НастройкаОрганизацийСрезПоследних
		|ГДЕ
		|	НастройкаОрганизацийСрезПоследних.ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаОрганизацийСрезПоследних.Организация
		|ИЗ
		|	РегистрСведений.ПрименениеПереводовВПути.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК НастройкаОрганизацийСрезПоследних
		|ГДЕ
		|	НастройкаОрганизацийСрезПоследних.ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств";
		
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
